perf/scenarios/soak.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "artillery-api"

  pool: 10

  phases:
    - name: Soak
      duration: 180
      arrivalRate: 3

scenarios:
  - name: Soak - steady load
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "EUR"
            counterCurrency: "BRL"
            baseAccountId: "1"
            counterAccountId: "2"
            baseAmount: 5